01-ahmed-body/cases/slant35_re4.18M_symtest/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaces ("ahmedBody.stl");

// DIAGNOSTIC ONLY -- NOT USED BY THE MESH (see README Section 10.6):
// snappyHexMeshDict's "features" list is empty for every case in this
// project, so the .eMesh file this produces is never read by
// snappyHexMesh. Run purely to characterize this body's real sharp
// edges and reason about resolveFeatureAngle (a separate parameter).
includedAngle   90;

subsetFeatures
{
    nonManifoldEdges    yes;
    openEdges           yes;
}

// ************************************************************************* //
